---
kind: method
id: M:Autodesk.Revit.DB.FamilyTypeSet.GetEnumerator
source: html/28920ddb-eb54-9ab2-c5ae-a6dc9f95f29a.htm
---
# Autodesk.Revit.DB.FamilyTypeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.